Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: واتل عليهم نبأ نوح إذ قال لقومه يا قوم إن كان كبر عليكم مقامي وتذكيري بآيات الله فعلى الله توكلت فأجمعوا أمركم وشركاءكم ثم لا يكن أمركم عليكم غمة ثم اقضوا إلي ولا تنظرون
en: And recite to them the news of Nuh (Noah). When he said to his people: "O my people, if my stay (with you), and my reminding (you) of the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah is hard on you, then I put my trust in Allah. So devise your plot, you and your partners, and let not your plot be in doubt for you. Then pass your sentence on me and give me no respite.

source: فإن توليتم فما سألتكم من أجر إن أجري إلا على الله وأمرت أن أكون من المسلمين
en: "But if you turn away [from accepting my doctrine of Islamic Monotheism, i.e. to worship none but Allah], then no reward have I asked of you; my reward is only from Allah, and I have been commanded to be of the Muslims (i.e. those who submit to Allah's Will)."

source: فكذبوه فنجيناه ومن معه في الفلك وجعلناهم خلائف وأغرقنا الذين كذبوا بآياتنا فانظر كيف كان عاقبة المنذرين
en: They denied him, but We delivered him, and those with him in the ship, and We made them generations replacing one after another, while We drowned those who belied Our Ayat (proofs, evidence, lessons, signs, revelations, etc.). Then see what was the end of those who were warned.

source: ثم بعثنا من بعده رسلا إلى قومهم فجاءوهم بالبينات فما كانوا ليؤمنوا بما كذبوا به من قبل كذلك نطبع على قلوب المعتدين
en: Then after him We sent Messengers to their people. They brought them clear proofs, but they would not believe what they had already rejected beforehand. Thus We seal the hearts of the transgressors (those who disbelieve in the Oneness of Allah and disobey Him).

source: ثم بعثنا من بعدهم موسى وهارون إلى فرعون وملئه بآياتنا فاستكبروا وكانوا قوما مجرمين
en: Then after them We sent Musa (Moses) and Harun (Aaron) to Fir'aun (Pharaoh) and his chiefs with Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.). But they behaved arrogantly and were Mujrimun (disbelievers, sinners, polytheists, criminals) folk.

source: فلما جاءهم الحق من عندنا قالوا إن هذا لسحر مبين
en: So when came to them the truth from Us, they said: "This is indeed clear magic."

source: قال موسى أتقولون للحق لما جاءكم أسحر هذا ولا يفلح الساحرون
en: Musa (Moses) said: "Say you (this) about the truth when it has come to you? Is this magic? But the magicians will never be successful."

source: قالوا أجئتنا لتلفتنا عما وجدنا عليه آباءنا وتكون لكما الكبرياء في الأرض وما نحن لكما بمؤمنين
en: They said: "Have you come to us to turn us away from that (Faith) we found our fathers following, and that you two may have greatness in the land? We are not going to believe you two!"

source: وقال فرعون ائتوني بكل ساحر عليم
en: And Fir'aun (Pharaoh) said: "Bring me every well-versed sorcerer."

source: فلما جاء السحرة قال لهم موسى ألقوا ما أنتم ملقون
en: And when the sorcerers came, Musa (Moses) said to them: "Cast down what you want to cast!"

source: فلما ألقوا قال موسى ما جئتم به السحر إن الله سيبطله إن الله لا يصلح عمل المفسدين
en: Then when they had cast down, Musa (Moses) said: "What you have brought is sorcery; Allah will surely make it of no effect. Verily, Allah does not set right the work of Al-Mufsidun (the evil-doers, corrupters).

source: ويحق الله الحق بكلماته ولو كره المجرمون
en: "And Allah will establish and make apparent the truth by His Words, however much the Mujrimun (criminals, disbelievers, polytheists, sinners) may hate it."

source: فما آمن لموسى إلا ذرية من قومه على خوف من فرعون وملئهم أن يفتنهم وإن فرعون لعال في الأرض وإنه لمن المسرفين
en: But none believed in Musa (Moses) except the offspring of his people, because of the fear of Fir'aun (Pharaoh) and his chiefs, lest they should persecute them; and verily, Fir'aun (Pharaoh) was an arrogant tyrant on the earth, he was indeed one of the Musrifun (polytheists, sinners and transgressors, those who give up the truth and follow the evil, and commit all kinds of great sins).

source: وقال موسى يا قوم إن كنتم آمنتم بالله فعليه توكلوا إن كنتم مسلمين
en: And Musa (Moses) said: "O my people! If you have believed in Allah, then put your trust in Him if you are Muslims (those who submit to Allah's Will)."

source: فقالوا على الله توكلنا ربنا لا تجعلنا فتنة للقوم الظالمين
en: They said: "In Allah we put our trust. Our Lord! Make us not a trial for the folk who are Zalimun (polytheists and wrong-doers) (i.e. do not make them overpower us).

source: ونجنا برحمتك من القوم الكافرين
en: "And save us by Your Mercy from the disbelieving folk."

source: وأوحينا إلى موسى وأخيه أن تبوآ لقومكما بمصر بيوتا واجعلوا بيوتكم قبلة وأقيموا الصلاة وبشر المؤمنين
en: And We revealed to Musa (Moses) and his brother (saying): "Provide dwellings for your people in Egypt, and make your dwellings as places for your worship, and perform As-Salat (Iqamat-as-Salat ), and give glad tidings to the believers."

source: وقال موسى ربنا إنك آتيت فرعون وملأه زينة وأموالا في الحياة الدنيا ربنا ليضلوا عن سبيلك ربنا اطمس على أموالهم واشدد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم
en: And Musa (Moses) said: "Our Lord! You have indeed bestowed on Fir'aun (Pharaoh) and his chiefs splendour and wealth in the life of this world, our Lord! that they may lead men astray from Your Path. Our Lord! Destroy their wealth, and harden their hearts, so that they will not believe until they see the painful torment."

source: قال قد أجيبت دعوتكما فاستقيما ولا تتبعان سبيل الذين لا يعلمون
en: Allah said: "Verily, the invocation of you both is accepted. So you both keep to the Straight Way (i.e. keep on doing good deeds and preaching Allah's Message with patience), and follow not the path of those who know not (the truth i.e. to believe in the Oneness of Allah, and also to believe in the Reward of Allah: Paradise)."

source: وجاوزنا ببني إسرائيل البحر فأتبعهم فرعون وجنوده بغيا وعدوا حتى إذا أدركه الغرق قال آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل وأنا من المسلمين
en: And We took the Children of Israel across the sea, and Fir'aun (Pharaoh) with his hosts followed them in oppression and enmity, till when drowning overtook him, he said: "I believe that none has the right to be worshipped but He (Allah) in Whom the Children of Israel believe, and I am one of the Muslims (those who submit to Allah's Will)."

source: آلآن وقد عصيت قبل وكنت من المفسدين
en: Now (you believe) while you refused to believe before and you were one of the Mufsidun (evil-doers, the corrupters).

source: فاليوم ننجيك ببدنك لتكون لمن خلفك آية وإن كثيرا من الناس عن آياتنا لغافلون
en: So this day We shall deliver your (dead) body (out from the sea) that you may be a sign to those who come after you! And verily, many among mankind are heedless of Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.).

source: ولقد بوأنا بني إسرائيل مبوأ صدق ورزقناهم من الطيبات فما اختلفوا حتى جاءهم العلم إن ربك يقضي بينهم يوم القيامة فيما كانوا فيه يختلفون
en: And indeed We settled the Children of Israel in an honourable dwelling place (Sham and Misr), and provided them with good things, and they differed not until the knowledge came to them. Verily, Allah will judge between them on the Day of Resurrection in that in which they used to differ.

source: فإن كنت في شك مما أنزلنا إليك فاسأل الذين يقرءون الكتاب من قبلك لقد جاءك الحق من ربك فلا تكونن من الممترين
en: So if you (O Muhammad صلى الله عليه وسلم) are in doubt concerning that which We have revealed unto you, [i.e. that your name is written in the Taurat (Torah) and the Injeel (Gospel)], then ask those who are reading the Book [the Taurat (Torah) and the Injeel (Gospel)] before you. Verily, the truth has come to you from your Lord. So be not of those who doubt (it).

source: ولا تكونن من الذين كذبوا بآيات الله فتكون من الخاسرين
en: And be not one of those who belie the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah, for then you shall be one of the losers.

source: إن الذين حقت عليهم كلمت ربك لا يؤمنون
en: Truly! Those, against whom the Word (Wrath) of your Lord has been justified, will not believe.

source: ولو جاءتهم كل آية حتى يروا العذاب الأليم
en: Even if every sign should come to them, until they see the painful torment.

source: فلولا كانت قرية آمنت فنفعها إيمانها إلا قوم يونس لما آمنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين
en: Was there any town (community) that believed (after seeing the punishment), and its Faith (at that moment) saved it (from the punishment)? (The answer is none) - except the people of Yunus (Jonah); when they believed, We removed from them the torment of disgrace in the life of the (present) world, and permitted them to enjoy for a while.

source: ولو شاء ربك لآمن من في الأرض كلهم جميعا أفأنت تكره الناس حتى يكونوا مؤمنين
en: And had your Lord willed, those on earth would have believed, all of them together. So, will you (O Muhammad صلى الله عليه وسلم) then compel mankind, until they become believers.

source: وما كان لنفس أن تؤمن إلا بإذن الله ويجعل الرجس على الذين لا يعقلون
en: It is not for any person to believe, except by the Leave of Allah, and He will put the wrath on those who are heedless.

source: قل انظروا ماذا في السماوات والأرض وما تغني الآيات والنذر عن قوم لا يؤمنون
en: Say: "Behold all that is in the heavens and the earth," but neither Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) nor warners benefit those who believe not.

source: فهل ينتظرون إلا مثل أيام الذين خلوا من قبلهم قل فانتظروا إني معكم من المنتظرين
en: Then do they wait for (anything) save for (a destruction) like that of the days of the men who passed away before them? Say: "Wait then, I am (too) with you among those who wait."

source: ثم ننجي رسلنا والذين آمنوا كذلك حقا علينا ننج المؤمنين
en: Then (in the end) We save Our Messengers and those who believe! Thus it is incumbent upon Us to save the believers.

source: قل يا أيها الناس إن كنتم في شك من ديني فلا أعبد الذين تعبدون من دون الله ولكن أعبد الله الذي يتوفاكم وأمرت أن أكون من المؤمنين
en: Say (O Muhammad صلى الله عليه وسلم): "O you mankind! If you are in doubt as to my religion (Islam), then (know that) I will never worship those whom you worship besides Allah. But I worship Allah Who causes you to die, and I am commanded to be one of the believers.

source: وأن أقم وجهك للدين حنيفا ولا تكونن من المشركين
en: "And (it is revealed to me): Direct your face (O Muhammad صلى الله عليه وسلم) entirely towards the religion Hanif (Islamic Monotheism, i.e. to worship none but Allah Alone), and never be one of the Mushrikun (those who ascribe partners to Allah, polytheists, idolaters, disbelievers in the Oneness of Allah, and those who worship others along with Allah).

source: ولا تدع من دون الله ما لا ينفعك ولا يضرك فإن فعلت فإنك إذا من الظالمين
en: "And invoke not besides Allah, any such that will neither profit you nor harm you, but if (in case) you did so, you shall certainly be one of the Zalimun (polytheists and wrong-doers). "

source: وإن يمسسك الله بضر فلا كاشف له إلا هو وإن يردك بخير فلا راد لفضله يصيب به من يشاء من عباده وهو الغفور الرحيم
en: And if Allah touches you with harm, there is none who can remove it but He, and if He intends any good for you, there is none who can repel His Favour which He causes it to reach whomsoever of His slaves He wills. And He is the Oft-Forgiving, the Most Merciful.

source: قل يا أيها الناس قد جاءكم الحق من ربكم فمن اهتدى فإنما يهتدي لنفسه ومن ضل فإنما يضل عليها وما أنا عليكم بوكيل
en: Say: "O you mankind! Now truth (i.e. the Qur'an and Prophet Muhammad صلى الله عليه وسلم) has come to you from your Lord. So whosoever receives guidance, he does so for the good of his own self; and whosoever goes astray, he does so to his own loss; and I am not (set) over you as a Wakil (disposer of affairs to oblige you for guidance)."

source: واتبع ما يوحى إليك واصبر حتى يحكم الله وهو خير الحاكمين
en: And (O Muhammad صلى الله عليه وسلم), follow the revelation sent unto you, and be patient till Allah gives judgement. And He is the Best of judges.

source: الر كتاب أحكمت آياته ثم فصلت من لدن حكيم خبير
en: Alif-Lam-Ra. [These letters are one of the miracles of the Qur'an and none but Allah (Alone) knows their meanings]. (This is) a Book, the Verses whereof are perfected (in every sphere of knowledge), and then explained in detail from One (Allah) Who is All-Wise Well-Acquainted (with all things).

source: ألا تعبدوا إلا الله إنني لكم منه نذير وبشير
en: (Saying) worship none but Allah. Verily, I (Muhammad صلى الله عليه و سلم) am unto you from Him a warner and a bringer of glad tidings.

source: وأن استغفروا ربكم ثم توبوا إليه يمتعكم متاعا حسنا إلى أجل مسمى ويؤت كل ذي فضل فضله وإن تولوا فإني أخاف عليكم عذاب يوم كبير
en: And (commanding you): "Seek the forgiveness of your Lord, and turn to Him in repentance, that He may grant you good enjoyment, for a term appointed, and bestow His abounding Grace to every owner of grace (i.e. the one who helps and serves the needy and deserving, physically and with his wealth, and even with good words). But if you turn away, then I fear for you the torment of a Great Day (i.e. the Day of Resurrection).

source: إلى الله مرجعكم وهو على كل شيء قدير
en: To Allah is your return, and He is Able to do all things."

source: ألا إنهم يثنون صدورهم ليستخفوا منه ألا حين يستغشون ثيابهم يعلم ما يسرون وما يعلنون إنه عليم بذات الصدور
en: No doubt! They did fold up their breasts, that they may hide from Him. Surely, even when they cover themselves with their garments, He knows what they conceal and what they reveal. Verily, He is the All-Knower of the (innermost secrets) of the breasts.

source: وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين
en: And no moving (living) creature is there on earth but its provision is due from Allah. And He knows its dwelling place and its deposit (in the uterus, grave). All is in a Clear Book (Al-Lauh Al-Mahfuz - the Book of Decrees with Allah).

source: وهو الذي خلق السماوات والأرض في ستة أيام وكان عرشه على الماء ليبلوكم أيكم أحسن عملا ولئن قلت إنكم مبعوثون من بعد الموت ليقولن الذين كفروا إن هذا إلا سحر مبين
en: And He it is Who has created the heavens and the earth in six Days and His Throne was on the water, that He might try you, which of you is the best in deeds. But if you were to say to them: "You shall indeed be raised up after death," those who disbelieve would be sure to say, "This is nothing but obvious magic. "

source: ولئن أخرنا عنهم العذاب إلى أمة معدودة ليقولن ما يحبسه ألا يوم يأتيهم ليس مصروفا عنهم وحاق بهم ما كانوا به يستهزئون
en: And if We delay the torment for them till a determined term, they are sure to say, "What keeps it back?" Verily, on the day it reaches them, nothing will turn it away from them, and they will be surrounded by (or fall in) that at which they used to mock!

source: ولئن أذقنا الإنسان منا رحمة ثم نزعناها منه إنه ليئوس كفور
en: And if We give man a taste of Mercy from Us, and then withdraw it from him, verily! he is despairing, ungrateful.

source: ولئن أذقناه نعماء بعد ضراء مسته ليقولن ذهب السيئات عني إنه لفرح فخور
en: But if We let him taste good (favour) after evil (poverty and harm) has touched him, he is sure to say: "Ills have departed from me." Surely, he is exultant, and boastful (ungrateful to Allah).

source: إلا الذين صبروا وعملوا الصالحات أولئك لهم مغفرة وأجر كبير
en: Except those who show patience and do righteous good deeds: those, theirs will be forgiveness and a great reward (Paradise).

source: فلعلك تارك بعض ما يوحى إليك وضائق به صدرك أن يقولوا لولا أنزل عليه كنز أو جاء معه ملك إنما أنت نذير والله على كل شيء وكيل
en: So perchance you (Muhammad صلى الله عليه و سلم) may give up a part of what is revealed unto you, and that your breast feels straitened for it because they say, "Why has not a treasure been sent down unto him, or an angel has come with him?" But you are only a warner. And Allah is a Wakil (Disposer of affairs, Trustee, Guardian) over all things.

source: أم يقولون افتراه قل فأتوا بعشر سور مثله مفتريات وادعوا من استطعتم من دون الله إن كنتم صادقين
en: Or they say, "He (Prophet Muhammad صلى الله عليه و سلم) forged it (the Qur'an)." Say: "Bring you then ten forged Surahs (chapters) like unto it, and call whomsoever you can, other than Allah (to your help), if you speak the truth!"

source: فإلم يستجيبوا لكم فاعلموا أنما أنزل بعلم الله وأن لا إله إلا هو فهل أنتم مسلمون
en: If then they answer you not, know then that it [the Revelation (this Qur'an)] is sent down with the Knowledge of Allah and that La ilaha illa Huwa: (none has the right to be worshipped but He)! Will you then be Muslims (those who submit in Islam)?

source: من كان يريد الحياة الدنيا وزينتها نوف إليهم أعمالهم فيها وهم فيها لا يبخسون
en: Whosoever desires the life of the world and its glitter, to them We shall pay in full (the wages of) their deeds therein, and they will have no diminution therein.

source: أولئك الذين ليس لهم في الآخرة إلا النار وحبط ما صنعوا فيها وباطل ما كانوا يعملون
en: They are those for whom there is nothing in the Hereafter but Fire, and vain are the deeds they did therein. And of no effect is that which they used to do.

source: أفمن كان على بينة من ربه ويتلوه شاهد منه ومن قبله كتاب موسى إماما ورحمة أولئك يؤمنون به ومن يكفر به من الأحزاب فالنار موعده فلا تك في مرية منه إنه الحق من ربك ولكن أكثر الناس لا يؤمنون
en: Can they (Muslims) who rely on a clear proof (the Qur'an) from their Lord, and whom a witness [Jibril (Gabriel عليه السلام)] from Him recites (follows) it (can they be equal with the disbelievers); and before it, came the Book of Musa (Moses), a guidance and a mercy, they believe therein, but those of the sects (Jews, Christians and all the other non-Muslim nations) that reject it (the Qur'an), the Fire will be their promised meeting-place. So be not in doubt about it (i.e. those who denied Prophet Muhammad صلى الله عليه و سلم and also denied all that which he brought from Allah. Surely, they will enter Hell). Verily, it is the truth from your Lord, but most of the mankind believe not.

source: ومن أظلم ممن افترى على الله كذبا أولئك يعرضون على ربهم ويقول الأشهاد هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين
en: And who does more wrong than he who invents a lie against Allah. Such will be brought before their Lord, and the witnesses will say, "These are the ones who lied against their Lord!" No doubt! the curse of Allah is on the Zalimun (polytheists, wrong-doers, oppressors).

source: الذين يصدون عن سبيل الله ويبغونها عوجا وهم بالآخرة هم كافرون
en: Those who hinder (others) from the Path of Allah (Islamic Monotheism), and seek a crookedness therein, while they are disbelievers in the Hereafter.

source: أولئك لم يكونوا معجزين في الأرض وما كان لهم من دون الله من أولياء يضاعف لهم العذاب ما كانوا يستطيعون السمع وما كانوا يبصرون
en: By no means will they escape (from Allah's Torment) on earth, nor have they protectors besides Allah! Their torment will be doubled! They could not bear to hear (the preachers of the truth) and they used not to see (the truth because of their severe aversion, in spite of the fact that they had the sense of hearing and sight).

source: أولئك الذين خسروا أنفسهم وضل عنهم ما كانوا يفترون
en: They are those who have lost their ownselves, and their invented false deities will vanish from them.

source: لا جرم أنهم في الآخرة هم الأخسرون
en: Certainly, they are those who will be the greatest losers in the Hereafter.

source: إن الذين آمنوا وعملوا الصالحات وأخبتوا إلى ربهم أولئك أصحاب الجنة هم فيها خالدون
en: Verily, those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, and humble themselves (in repentance and obedience) before their Lord, they will be dwellers of Paradise to dwell therein forever.

source: مثل الفريقين كالأعمى والأصم والبصير والسميع هل يستويان مثلا أفلا تذكرون
en: The likeness of the two parties is as the blind and the deaf and the seer and the hearer. Are they equal when compared? Will you not then take heed?

source: ولقد أرسلنا نوحا إلى قومه إني لكم نذير مبين
en: And indeed We sent Nuh (Noah) to his people (and he said): "I have come to you as a plain warner."

source: أن لا تعبدوا إلا الله إني أخاف عليكم عذاب يوم أليم
en: "That you worship none but Allah; surely, I fear for you the torment of a painful Day."

source: فقال الملأ الذين كفروا من قومه ما نراك إلا بشرا مثلنا وما نراك اتبعك إلا الذين هم أراذلنا بادي الرأي وما نرى لكم علينا من فضل بل نظنكم كاذبين
en: The chiefs who disbelieved among his people said: "We see you but a man like ourselves, nor do we see any follow you but the meanest among us and they (too) followed you without thinking. And we do not see in you any merit above us, in fact we think you are liars."

source: قال يا قوم أرأيتم إن كنت على بينة من ربي وآتاني رحمة من عنده فعميت عليكم أنلزمكموها وأنتم لها كارهون
en: He said: "O my people! Tell me, if I have a clear proof from my Lord, and a Mercy (Prophethood) has come to me from Him, but that (Mercy) has been obscured from your sight. Shall we compel you to accept it (Islamic Monotheism) when you have a strong hatred for it?

source: ويا قوم لا أسألكم عليه مالا إن أجري إلا على الله وما أنا بطارد الذين آمنوا إنهم ملاقو ربهم ولكني أراكم قوما تجهلون
en: "And O my people! I ask of you no wealth for it, my reward is from none but Allah. I am not going to drive away those who have believed. Surely, they are going to meet their Lord, but I see that you are a people that are ignorant.

source: ويا قوم من ينصرني من الله إن طردتهم أفلا تذكرون
en: "And O my people! Who will help me against Allah, if I drove them away? Will you not then give a thought?

source: ولا أقول لكم عندي خزائن الله ولا أعلم الغيب ولا أقول إني ملك ولا أقول للذين تزدري أعينكم لن يؤتيهم الله خيرا الله أعلم بما في أنفسهم إني إذا لمن الظالمين
en: "And I do not say to you that with me are the Treasures of Allah, nor that I know the Ghaib (Unseen), nor do I say I am an angel, and I do not say of those whom your eyes look down upon that Allah will not bestow any good on them. Allah knows what is in their inner-selves (as regards belief, etc.). In that case, I should, indeed be one of the Zalimun (wrong-doers, oppressors)."

source: قالوا يا نوح قد جادلتنا فأكثرت جدالنا فأتنا بما تعدنا إن كنت من الصادقين
en: They said: "O Nuh (Noah)! You have disputed with us and much have you prolonged the dispute with us, now bring upon us what you threaten us with, if you are of the truthful."

source: قال إنما يأتيكم به الله إن شاء وما أنتم بمعجزين
en: He said: "Only Allah will bring it (the punishment) on you, if He wills, and then you will escape not.

source: ولا ينفعكم نصحي إن أردت أن أنصح لكم إن كان الله يريد أن يغويكم هو ربكم وإليه ترجعون
en: "And my advice will not profit you, even if I wish to give you good counsel, if Allah's Will is to keep you astray. He is your Lord! and to Him you shall return."

source: أم يقولون افتراه قل إن افتريته فعلي إجرامي وأنا بريء مما تجرمون
en: Or they (the pagans of Makkah) say: "He (Muhammad صلى الله عليه و سلم) has fabricated it (the Qur'an)." Say: "If I have fabricated it, upon me be my crimes, but I am innocent of (all) those crimes which you commit."

source: وأوحي إلى نوح أنه لن يؤمن من قومك إلا من قد آمن فلا تبتئس بما كانوا يفعلون
en: And it was revealed to Nuh (Noah): "None of your people will believe except those who have believed already. So be not sad because of what they used to do.

source: واصنع الفلك بأعيننا ووحينا ولا تخاطبني في الذين ظلموا إنهم مغرقون
en: "And construct the ship under Our Eyes and with Our Revelation, and call not upon Me on behalf of those who did wrong; they are surely to be drowned."
